# sea_battle
Морской бой
Ограничение времени	1 секунда
Ограничение памяти	64Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
Дима любит играть в морской бой. К сожалению, он очень рассеян и постоянно неправильно отмечает на карте клетки, по которым уже стрелял. Напишите класс, который будет строить за Диму карту.

Класс SeaMap должен иметь следующие методы (sm – экземпляр SeaMap):

sm.shoot(row, col, result) — добавить на карту результат выстрела, где
row — индекс ряда карты,
col — индекс вертикальной колонки карты,
result — одна из строк: “miss” (промах), “hit” (попадание), “sink” (потопление корабля).

sm.cell(row, col), который
возвращает ‘.’, если в клетке с координатами row, col может находиться корабль,
возвращает ‘*’, если в клетку уже стреляли или она находится рядом с потопленным кораблём,
возвращает ‘x’ если в клетке было попадание.

Учтите, что не нужно помечать ‘*’ клетки рядом с кораблём, в который попали, но не потопили до конца.

Формат ввода
Каждый тест представляет собой код, в котором будет использоваться ваш класс. Файл c решением не обязательно называть solution.py, он будет переименован автоматически. Тест запускается с вашим классом, а его вывод сравнивается с правильным решением.

Пример 1
Ввод	Вывод
from solution import SeaMap

sm = SeaMap()
sm.shoot(2, 0, 'miss')
sm.shoot(6, 9, 'miss')
for row in range(10):
    for col in range(10):
        print(sm.cell(row, col), end='')
    print()
    
..........
..........
*.........
..........
..........
..........
.........*
..........
..........
..........
Пример 2
Ввод	Вывод
from solution import SeaMap

sm = SeaMap()
sm.shoot(2, 0, 'sink')
sm.shoot(6, 9, 'hit')
for row in range(10):
    for col in range(10):
        print(sm.cell(row, col), end='')
    print()


..........
**........
x*........
**........
..........
..........
.........x
..........
..........
..........
Пример 3
Ввод	Вывод
from solution import SeaMap

sm = SeaMap()
sm.shoot(0, 0, 'sink')
sm.shoot(0, 9, 'sink')
sm.shoot(9, 0, 'sink')
sm.shoot(9, 9, 'sink')
for row in range(10):
    for col in range(10):
        print(sm.cell(row, col), end='')
    print()
    
x*......*x
**......**
..........
..........
..........
..........
..........
..........
**......**
x*......*x
Примечания
Игровое поле имеет размер 10 на 10 клеток.
